src/main/java/ru/vk/itmo/test/timofeevkirill/results/task2/wrk2/get/h_15_000rps_16threads_8192linked_64connections
./wrk -d 2m -t 8 -c 64 -R 15000 -s /home/aphirri/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/timofeevkirill/scripts/lua/get.lua -L http://localhost:8080/v0/entry
Running 2m test @ http://localhost:8080/v0/entry
  8 threads and 64 connections
  Thread calibration: mean lat.: 10.886ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.710ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10.473ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.391ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.438ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9.111ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10.473ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 8.986ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.58ms  530.67us   5.59ms   67.16%
    Req/Sec     1.98k   164.34     2.67k    65.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.52ms
 75.000%    1.92ms
 90.000%    2.32ms
 99.000%    2.97ms
 99.900%    3.52ms
 99.990%    3.88ms
 99.999%    4.21ms
100.000%    5.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.348     0.000000            1         1.00
       0.940     0.100000       165258         1.11
       1.108     0.200000       330059         1.25
       1.251     0.300000       495633         1.43
       1.385     0.400000       660052         1.67
       1.520     0.500000       825084         2.00
       1.590     0.550000       908205         2.22
       1.662     0.600000       990159         2.50
       1.739     0.650000      1072449         2.86
       1.823     0.700000      1154614         3.33
       1.918     0.750000      1237152         4.00
       1.971     0.775000      1278655         4.44
       2.028     0.800000      1319888         5.00
       2.091     0.825000      1361089         5.71
       2.159     0.850000      1401996         6.67
       2.237     0.875000      1444229         8.00
       2.277     0.887500      1464227         8.89
       2.321     0.900000      1484901        10.00
       2.367     0.912500      1505240        11.43
       2.419     0.925000      1525861        13.33
       2.477     0.937500      1546586        16.00
       2.509     0.943750      1557042        17.78
       2.543     0.950000      1567389        20.00
       2.579     0.956250      1577288        22.86
       2.623     0.962500      1587917        26.67
       2.671     0.968750      1597929        32.00
       2.699     0.971875      1603149        35.56
       2.729     0.975000      1608227        40.00
       2.763     0.978125      1613379        45.71
       2.803     0.981250      1618590        53.33
       2.851     0.984375      1623711        64.00
       2.879     0.985938      1626343        71.11
       2.909     0.987500      1628771        80.00
       2.945     0.989062      1631347        91.43
       2.989     0.990625      1634009       106.67
       3.037     0.992188      1636527       128.00
       3.067     0.992969      1637846       142.22
       3.099     0.993750      1639078       160.00
       3.137     0.994531      1640394       182.86
       3.177     0.995313      1641682       213.33
       3.223     0.996094      1642978       256.00
       3.249     0.996484      1643589       284.44
       3.277     0.996875      1644253       320.00
       3.311     0.997266      1644893       365.71
       3.347     0.997656      1645526       426.67
       3.389     0.998047      1646186       512.00
       3.413     0.998242      1646497       568.89
       3.437     0.998437      1646813       640.00
       3.463     0.998633      1647137       731.43
       3.493     0.998828      1647465       853.33
       3.525     0.999023      1647781      1024.00
       3.541     0.999121      1647938      1137.78
       3.563     0.999219      1648097      1280.00
       3.585     0.999316      1648259      1462.86
       3.615     0.999414      1648423      1706.67
       3.641     0.999512      1648580      2048.00
       3.661     0.999561      1648668      2275.56
       3.681     0.999609      1648748      2560.00
       3.699     0.999658      1648828      2925.71
       3.721     0.999707      1648901      3413.33
       3.747     0.999756      1648985      4096.00
       3.763     0.999780      1649026      4551.11
       3.779     0.999805      1649062      5120.00
       3.799     0.999829      1649106      5851.43
       3.825     0.999854      1649142      6826.67
       3.853     0.999878      1649182      8192.00
       3.867     0.999890      1649202      9102.22
       3.887     0.999902      1649222     10240.00
       3.901     0.999915      1649246     11702.86
       3.923     0.999927      1649263     13653.33
       3.951     0.999939      1649283     16384.00
       3.957     0.999945      1649293     18204.44
       3.971     0.999951      1649304     20480.00
       3.987     0.999957      1649314     23405.71
       4.021     0.999963      1649323     27306.67
       4.045     0.999969      1649333     32768.00
       4.063     0.999973      1649338     36408.89
       4.073     0.999976      1649343     40960.00
       4.091     0.999979      1649348     46811.43
       4.103     0.999982      1649353     54613.33
       4.139     0.999985      1649358     65536.00
       4.171     0.999986      1649361     72817.78
       4.203     0.999988      1649365     81920.00
       4.211     0.999989      1649367     93622.86
       4.227     0.999991      1649368    109226.67
       4.279     0.999992      1649371    131072.00
       4.283     0.999993      1649372    145635.56
       4.299     0.999994      1649373    163840.00
       4.391     0.999995      1649375    187245.71
       4.399     0.999995      1649376    218453.33
       4.495     0.999996      1649377    262144.00
       4.503     0.999997      1649378    291271.11
       4.503     0.999997      1649378    327680.00
       4.599     0.999997      1649379    374491.43
       4.751     0.999998      1649380    436906.67
       4.751     0.999998      1649380    524288.00
       4.799     0.999998      1649381    582542.22
       4.799     0.999998      1649381    655360.00
       4.799     0.999999      1649381    748982.86
       4.967     0.999999      1649382    873813.33
       4.967     0.999999      1649382   1048576.00
       4.967     0.999999      1649382   1165084.44
       4.967     0.999999      1649382   1310720.00
       4.967     0.999999      1649382   1497965.71
       5.595     0.999999      1649383   1747626.67
       5.595     1.000000      1649383          inf
#[Mean    =        1.581, StdDeviation   =        0.531]
#[Max     =        5.592, Total count    =      1649383]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1799730 requests in 2.00m, 154.47MB read
Requests/sec:  14997.85
Transfer/sec:      1.29MB